// написать программу замены элементов массива на противоположные
int [] arr = { 1, 2, 3, 4, 5};

foreach(int v in arr)
{
    Console.WriteLine(-v);
}